tap "jandedobbeleer/oh-my-posh"
tap "oven-sh/bun"
brew "exercism"
brew "gh"
brew "git"
brew "libpq"
brew "node"
brew "neonctl"
brew "neovim"
brew "pnpm"
brew "postgresql@14", restart_service: :changed
brew "ripgrep"
brew "tree"
brew "uv"
brew "wireshark"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "oven-sh/bun/bun"
cask "codex"
cask "font-fira-code"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "visual-studio-code"
cask "zed@preview"
vscode "asvetliakov.vscode-neovim"
vscode "avetis.tokyo-night"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "databricks.neon-local-connect"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "figma.figma-vscode-extension"
vscode "ftsamoyed.theme-pink-cat-boo"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "huacat.pink-theme"
vscode "julianiaquinandi.nvim-ui-modifier"
vscode "klyap.vscode-celestial-magic-girl-icon-theme"
vscode "mgwg.light-pink-theme"
vscode "mintchipleaf.fairyfloss"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "mylesmurphy.prettify-ts"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "siris01.catppuccin-theme"
vscode "solomonkinard.git-blame"
vscode "tamasfe.even-better-toml"
vscode "tinybirdco.vscode-tinybird-support"
vscode "tomoki1207.pdf"
vscode "tonybaloney.vscode-pets"
vscode "zainchen.json"
uv "tinybird"
